app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 7], ["post_id", 8]]
---
      <%= link_to "Add comment", new_user_post_comment_path(post.author, post) %>
      <% post.recent_comments.includes(:user).each do |comment| %>