app/views/posts/show.html.erb

    <strong><%= link_to "Add comment", new_user_post_comment_path(@post.author, @post) %></strong>
    <% @post.comments.includes(:user).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]