app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["post_id", 7], ["text", " lj ljjllkn"], ["created_at", "2024-01-20 15:36:13.255252"], ["updated_at", "2024-01-20 15:36:13.255252"]]
---
  def create
    @comment = current_user.comments.build(comment_params.merge(post: @post))

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 4]]
---
  def destroy
    @comment = Comment.find(params[:id])
    @post = @comment.post
    @user = @post.author
    @comment.destroy