app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id])
    @posts = @user.posts.includes(:comments).paginate(page: params[:page], per_page: 6)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2)  [["post_id", 7], ["post_id", 8]]

  def create
    @user = current_user
    @post = @user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("author_id", "title", "text", "comments_counter", "likes_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["author_id", 5], ["title", "f, cvf"], ["text", "f; kv"], ["comments_counter", 0], ["likes_counter", 0], ["created_at", "2024-01-20 15:35:15.226382"], ["updated_at", "2024-01-20 15:35:15.226382"]]

  def destroy
    @post = Post.find(params[:id])
    @user = @post.author
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 7]]