app/controllers/users_controller.rb

  def index
    @users = User.includes(:posts).all
---
SELECT "users".* FROM "users"

  def show
    @user = User.includes(posts: :author).find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]