app/models/comment.rb

UPDATE "posts" SET "comments_counter" = COALESCE("comments_counter", 0) + $1 WHERE "posts"."id" = $2  [["comments_counter", 1], ["id", 1]]
---
    def increment_post_comments_counter
      post.increment!(:comments_counter)