app/models/like.rb

UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) + $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 2]]
---
    def increment_post_likes_counter
      post.increment!(:likes_counter)